package java.for.beginner

public class Variable {

    public static void main (String[] args) {
        byte a = 0; //สามารถเก็บข้อมูลตัวเลขได้ตั้งแต่ -128 ถึง 127
        short b = 0; //สามารถเก็บข้อมูลตัวเลขได้ตั้งแต่ -32768 ถึง 32767
        int c = 0; //สามารถเก็บข้อมูลตัวเลขได้ตั้งแต่ -2147483648 ถึง 2147483647
        long d = 0; //สามารถเก็บข้อมูลตัวเลขได้ตั้งแต่ -9223372036854775808 ถึง 9223372036854775807
        float f = 0; //สามารถเก็บข้อมูลตัวเลขได้ตั้งแต่ 1.4E-45 ถึง 3.4028235E38
        double g = 0; //สามารถเก็บข้อมูลตัวเลขได้ตั้งแต่ 4.9E-324 ถึง 1.7976931348623157E308
        char h = "a"; 
        boolean i = true; //ใช้เก็บข้อมูล true และ false
        String j = "text" //ใช้เก็บข้อมูลประเภทข้อความ และ ตัวเลข
    }
    
}
